[error]
1=卡未初始化或找不到卡！
2=复位失败！
3=卡版本不对！
4=报警！
6=执行失败！
7=状态不对应!
16=命令超时！
17=命令丢失!
18=接口调用异步！
19=接口被其它程序占用!
20=Z轴超限或校正文件损坏！
21=参数不匹配!
23=内存分配失败!
100=脱机使用中!
101=命令被中止!

[4]
1 = 激光器过温，请关闭电源！
2 = 激光器高反报警，请关闭电源！
3 = 激光器MO异常，请关闭电源！
4 = 激光器盖子被打开，请关闭电源并装好激光器盖子！
5 = 安全门被打开，请关上安全门！
6 = 光闸关闭异常，请关闭电源并检查光闸！
7 = 光闸打开异常，请关闭电源并检查光闸！
8 = 安全门被打开，打标暂停，请关上安全门继续打标！
9 = 安全门被打开，打标中止！
10= 激光器系统报警，请关闭电源！
11= 激光器电源电压超范围，请关闭电源！
12= 激光器电源过压报警，请关闭电源并检查激光器电源！
13= 激光器电源欠压报警，请关闭电源并检查激光器电源！
14= SPI激光器过温报警，请关闭电源！
15= SPI激光器预备放大器过流报警，请关闭电源！
16= SPI激光器功率放大器过流报警，请关闭电源！
17= SPI激光器准直激光器报警，请关闭电源！
18= SPI激光器保留报警，请关闭电源！
19= SPI激光器电源报警，请关闭电源！
20= 激光器未知报警，请关闭电源！
21= 激光器电源过流报警，请关闭电源！
22= 激光器电源过压报警，请关闭电源！
23= 激光器电源过温报警，请关闭电源并检查散热条件！
24= 激光器电源未打开，请检查电源。
100=安全门有效且被打开!

110=碰到负限位!
111=碰到正限位!
112=运动中碰到原点!
500=振镜预热中，请稍侯再试!

[door]
1=安全门被打开，请关上安全门！
2=安全门被打开，打标暂停，请关上安全门继续打标！
3=安全门被打开，打标中止！
4=安全门已关上,可以继续打标！
5=安全门已关上,状态正常！
6=运动过程中碰到负限位，打标被中止！
7=运动过程中碰到正限位，打标被中止！

[usb]
1=EMCC卡已经连接
2=EMCC卡已经断开